/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   mess_err.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: pcorlys- <pcorlys-@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/08/18 14:19:33 by pcorlys-          #+#    #+#             */
/*   Updated: 2019/08/18 14:52:59 by pcorlys-         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../includes/wolf.h"

void	mess_err(int num)
{
	if (num == 1)
		ft_printf("Укажите один аргумент - файл карты\n");
	if (num == 2)
		ft_printf("Файл карты не был открыт\n");
	if (num == 3)
		ft_printf("Карта должна быть зациклина в стенах\n");
	if (num == 4)
		ft_printf("Карта имеет недопустимый размер (более 20 в высоту)\n");
	if (num == 5)
		ft_printf("На карте неправильные метки игрока\n");
	exit(0);
}

